Repository: pypi-data/pypi-mirror-62
Catalog: packages/cubicweb-calendar/cubicweb-calendar-0.11.1.tar.gz/cubicweb-calendar-0.11.1/cubicweb_calendar/i18n/*.po
Languages: fr

source: Calendar
fr: Calendrier

source: Calendar_plural
fr: Calendriers

source: Calendaruse
fr: Utilisation de calendrier

source: Calendaruse_plural
fr: Utilisations de calendrier

source: Day types
fr: Types de jours

source: Daytype
fr: Type de journée

source: Daytype_plural
fr: Types de journée

source: New Calendar
fr: Nouveau calendrier

source: New Calendaruse
fr: Nouvelle utilisation de calendrier

source: New Daytype
fr: Nouveau type de journée

source: New Recurrentday
fr: Nouveau type de jour récurrent

source: New Timeperiod
fr: Nouvelle période

source: New WeekDay
fr: Nouveau jour de semaine

source: Periods
fr: Périodes

source: Recurrent days
fr: Jour récurrent

source: Recurrentday
fr: Journée récurrente

source: Recurrentday_plural
fr: Journées récurrentes

source: This Calendar
fr: Ce calendrier

source: This Calendaruse
fr: Cette utilisation de calendrier

source: This Daytype
fr: Ce type de journée

source: This Recurrentday
fr: Ce jour récurrent

source: This Timeperiod
fr: Cette période

source: This WeekDay
fr: Ce jour de la semaine

source: Timeperiod
fr: Période

source: Timeperiod_plural
fr: Périodes

source: Week days
fr: Jours de semaine

source: WeekDay
fr: Jour de semaine

source: WeekDay_plural
fr: Jours de semaine

source: add Calendar day_types Daytype subject
fr: type de journée

source: add Calendar days Recurrentday subject
fr: jour récurrent

source: add Calendar inherits Calendar object
fr: extension calendrier

source: add Calendar inherits Calendar subject
fr: calendrier parent

source: add Calendar periods Timeperiod subject
fr: Période

source: add Calendar weekdays WeekDay subject
fr: jour de semaine

source: ask_off_days
fr: demander des jours de congés

source: creating Calendar (Calendar %(linkto)s inherits Calendar)
fr: création d'un calendrier parent de %(linkto)s

source: creating Calendar (Calendar inherits Calendar %(linkto)s)
fr: création d'un calendrier héritant de %(linkto)s

source: creating Daytype (Calendar %(linkto)s day_types Daytype)
fr: création d'un type de jour pour le calendrier %(linkto)s

source: creating Recurrentday (Calendar %(linkto)s days Recurrentday)
fr: création d'un jour récurrent dans le calendrier %(linkto)s

source: creating Timeperiod (Calendar %(linkto)s periods Timeperiod)
fr: création d'une période pour le calendrier %(linkto)s

source: creating WeekDay (Calendar %(linkto)s weekdays WeekDay)
fr: création d'un jour de semaine pour le calendrier %(linkto)s

source: day_month
fr: journée dans le mois

# Recurrentday
source: day_month
fr: journée dans le mois

source: day_of_week
fr: jour de la semaine

# WeekDay
source: day_of_week
fr: jour de la semaine

source: day_type
fr: type de journée

# Recurrentday
source: day_type
fr: type de journée

# Timeperiod
source: day_type
fr: type de journée

# WeekDay
source: day_type
fr: type de journée

source: day_type_object
fr: type de journée utilisé par

# Daytype
source: day_type_object
fr: type de journée utilisé par

source: day_types
fr: types de journée

# Calendar
source: day_types
fr: type de journée

source: day_types_object
fr: types de journée utilisés par

# Daytype
source: day_types_object
fr: type de journée utilisé par

source: days
fr: jours

# Calendar
source: days
fr: jours

source: days_object
fr: journée récurrente utilisée par

# Recurrentday
source: days_object
fr: journée récurrente utilisée par

source: display_in_user_request
fr: affiché quand l'utilisateur demande des congés

source: dt_nonworking
fr: journée non travaillée

source: dt_working
fr: journée de travail

source: dt_working_am
fr: matinée de travail

source: dt_working_pm
fr: après-midi de travail

source: facets_timeperiod-calendar-facet
fr: facette période de temps

source: friday
fr: vendredi

source: inherits
fr: hérite du calendrier

# Calendar
source: inherits
fr: hérite du calendrier

source: inherits_object
fr: hérité par

# Calendar
source: inherits_object
fr: hérité par

source: last day of the timeperiod
fr: dernier jour (inclus) de la période

source: monday
fr: lundi

source: pending
fr: en attente

source: periods
fr: périodes

# Calendar
source: periods
fr: périodes

source: periods_object
fr: périodes utilisées dans

# Timeperiod
source: periods_object
fr: périodes utilisées dans

source: saturday
fr: samedi

source: see projman
fr: voir projman

source: start
fr: début

# Calendaruse
source: start
fr: début

# Timeperiod
source: start
fr: début

source: stop
fr: fin

# Calendaruse
source: stop
fr: fin

# Timeperiod
source: stop
fr: fin

source: sunday
fr: dimanche

source: thursday
fr: jeudi

# Calendar
source: title
fr: titre

# Daytype
source: title
fr: titre

source: tuesday
fr: mardi

# Daytype
source: type
fr: type de journée

source: use_calendar
fr: utilise le calendrier

# Calendaruse
source: use_calendar
fr: utilise le calendrier

source: use_calendar_object
fr: calendrier utilisé par

# Calendar
source: use_calendar_object
fr: calendrier utilisé par

source: validate
fr: valider

source: validated
fr: validé

source: wednesday
fr: mercredi

source: week
fr: semaine

source: weekdays
fr: a pour jour de semaines

# Calendar
source: weekdays
fr: a pour jour de semaines

source: weekdays_object
fr: jour de semaine de

# WeekDay
source: weekdays_object
fr: jour de semaine de
