Repository: pypi-data/pypi-mirror-62
Catalog: packages/eea.daviz/eea.daviz-12.4.zip/eea.daviz-12.4/eea/daviz/locales/*/LC_MESSAGES/eea.po
Languages: fr

source: Add a data URL which returns CSV/TSV, standard JSON, Exhibit JSON or Google Spreadsheet
fr: Ajouter une adresse Web de données qui renvoie un fichier CSV/TSV, JSON standard, Exhibit JSON ou tableur Google

source: Add data from URL
fr: Ajouter de données à partir d'une adresse Web

source: Copy and paste a data table from a file/webpage
fr: Copier-coller un tableau de données à partir d'un fichier/d'une page Web

source: Data source Organisation
fr: Organisme de la source de données

source: Data source link
fr: Lien vers la source de données

source: Data source title
fr: Titre de la source de données

source: Daviz Settings
fr: Configuration de Daviz

source: Default Folder for Visualizations
fr: Dossier par défaut pour les visualisations

source: Find and reuse existing data
fr: Trouver et réutiliser des données existantes

source: Look for compatible datasets in catalogue (e.g. visualization data, .tsv, .csv, SPARQL, etc)
fr: Chercher des ensemble de données compatibles dans un catalogue (par exemple données de visualisation, .tsv, .csv, SPARQL, etc.)

source: Provided URL doesn't provide valid data for visualization or this type of data is not supported, yet.
fr: L'adresse Web fournie ne renvoie pas des données pouvant être visualisées ou ce type de données n'est pas supporté pour le moment

source: Specify data source
fr: Spécifier la source des données

source: Specify data source Organisation
fr: Spécifier l'organisme de la source de données

source: Specify data source link
fr: Spécifier le lien vers la source des données

source: Upload CSV/TSV data files from your computer
fr: Télécharger des fichiers de données CSV/TSV depuis votre ordinateur

source: Warning
fr: Avertissement

source: You should provide data in a valid CSV format(.csv, .tsv, etc)
fr: Vous devriez fournir des données dans un format CSV valide (.csv, .tsv, etc)
