Repository: pypi-data/pypi-mirror-62
Catalog: packages/cciaa.modulistica/cciaa.modulistica-3.0.1.tar.gz/cciaa.modulistica-3.0.1/cciaa/modulistica/locales/*/LC_MESSAGES/cciaa.modulistica.po
Languages: it

source: CCIAA: Downloadable Forms view
it: CCIAA: Vista modulistica

source: Downloadable forms view
it: Vista modulistica

source: External link
it: Collegamento esterno

source: Link
it: Collegamento

source: Show and organize files in the folder.
it: Mostra e organizza la modulistica nella cartella.

source: Some additional feature, mainly a new view, for make easy the download of forms and documents
it: Qualche funzionalità aggiunta, principalente una vista, per gestire facilmente la modulistica scaricabile

source: download_message
it: Scarica il file ${title}

source: external link
it: collegamento esterno

source: goto_message
it: Vai al collegamento ${title}

source: help_cciaafolder_columnstitles
it: Inserisci, una per riga (fino a 4), i titoli delle colonne che saranno inserite in testa alle tabelle generate quando saranno in uso le viste per la modulistica. Non fornite questi valori farà si che le instestazioni non siano visualizzate.

source: label_cciaafolder_columnstitles
it: Titoli delle colonne
